In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
# --- 1. Load your CSV file into a DataFrame ---
products = pd.read_csv("./datasets/Toy Store E-Commerce Database/products.csv")
orders = pd.read_csv("./datasets/Toy Store E-Commerce Database/orders.csv")
order_items = pd.read_csv("./datasets/Toy Store E-Commerce Database/order_items.csv")
order_item_refunds = pd.read_csv("./datasets/Toy Store E-Commerce Database/order_item_refunds.csv")
website_sessions = pd.read_csv("./datasets/Toy Store E-Commerce Database/website_sessions.csv")
website_pageviews = pd.read_csv("./datasets/Toy Store E-Commerce Database/website_pageviews.csv")

In [3]:
# --- 2. Create a MySQL connection engine ---
username = "jeremy"
password = "Mysql.003"
host = "localhost"
database = "toy_store_db"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}/{database}")

In [5]:
# --- 3. Save to MySQL table ---
orders.to_sql(
    name="orders",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)
order_items.to_sql(
    name="order_items",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)
order_item_refunds.to_sql(
    name="order_item_refunds",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)
products.to_sql(
    name="products",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)
website_sessions.to_sql(
    name="website_sessions",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)
website_pageviews.to_sql(
    name="website_pageviews",
    con=engine,
    if_exists="append",   # or "replace"
    index=False
)

print("CSV tables successfully saved to MySQL!")

CSV tables successfully saved to MySQL!

In [ ]:
import sqlite3
import mysql.connector

sqlite_conn = sqlite3.connect("your.db")
sqlite_cur = sqlite_conn.cursor()

mysql_conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="password",
    database="your_mysql_db"
)
mysql_cur = mysql_conn.cursor()

# Example: migrate a table
sqlite_cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = sqlite_cur.fetchall()

for table in tables:
    print("Migrating:", table[0])
    # Fetch data
    sqlite_cur.execute(f"SELECT * FROM {table[0]}")
    rows = sqlite_cur.fetchall()

    placeholders = ", ".join(["%s"] * len(rows[0]))

    insert_query = f"INSERT INTO {table[0]} VALUES ({placeholders})"

    mysql_cur.executemany(insert_query, rows)
    mysql_conn.commit()

In [99]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [100]:
%sql mysql+pymysql://root:Mysql.003@localhost:3306/toy_store_db

'Connected: root@toy_store_db'

In [5]:
%%sql

SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
6 rows affected.

[('order_item_refunds',),
 ('order_items',),
 ('orders',),
 ('products',),
 ('website_pageviews',),
 ('website_sessions',)]

In [13]:
%%sql
SELECT * FROM products LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, '2012-03-19 08:00:00', 'The Original Mr. Fuzzy'),
 (2, '2013-01-06 13:00:00', 'The Forever Love Bear'),
 (3, '2013-12-12 09:00:00', 'The Birthday Sugar Panda'),
 (4, '2014-02-05 10:00:00', 'The Hudson River Mini bear')]

In [14]:
%%sql
DESCRIBE products;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
3 rows affected.

[('product_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('product_name', 'text', 'YES', '', None, '')]

In [20]:
%%sql

SELECT * FROM orders LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, '2012-03-19 10:42:46', 20, 20, 1, 1, 49.99, 19.49),
 (2, '2012-03-19 19:27:37', 104, 104, 1, 1, 49.99, 19.49),
 (3, '2012-03-20 06:44:45', 147, 147, 1, 1, 49.99, 19.49),
 (4, '2012-03-20 09:41:45', 160, 160, 1, 1, 49.99, 19.49),
 (5, '2012-03-20 11:28:15', 177, 177, 1, 1, 49.99, 19.49),
 (6, '2012-03-20 16:12:47', 232, 232, 1, 1, 49.99, 19.49),
 (7, '2012-03-20 17:03:41', 241, 241, 1, 1, 49.99, 19.49),
 (8, '2012-03-20 23:35:27', 295, 295, 1, 1, 49.99, 19.49),
 (9, '2012-03-21 02:35:01', 304, 304, 1, 1, 49.99, 19.49),
 (10, '2012-03-21 06:45:58', 317, 317, 1, 1, 49.99, 19.49)]

In [7]:
%%sql

DESCRIBE orders;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
8 rows affected.

[('order_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('website_session_id', 'bigint(20)', 'YES', '', None, ''),
 ('user_id', 'bigint(20)', 'YES', '', None, ''),
 ('primary_product_id', 'bigint(20)', 'YES', '', None, ''),
 ('items_purchased', 'bigint(20)', 'YES', '', None, ''),
 ('price_usd', 'double', 'YES', '', None, ''),
 ('cogs_usd', 'double', 'YES', '', None, '')]

In [24]:
%%sql

SELECT 
    user_id,
    COUNT(DISTINCT(user_id)) AS counts
FROM orders
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(20, 31696)]

In [8]:
%%sql

SELECT * FROM order_items LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, '2012-03-19 10:42:46', 1, 1, 1, 49.99, 19.49),
 (2, '2012-03-19 19:27:37', 2, 1, 1, 49.99, 19.49),
 (3, '2012-03-20 06:44:45', 3, 1, 1, 49.99, 19.49),
 (4, '2012-03-20 09:41:45', 4, 1, 1, 49.99, 19.49),
 (5, '2012-03-20 11:28:15', 5, 1, 1, 49.99, 19.49),
 (6, '2012-03-20 16:12:47', 6, 1, 1, 49.99, 19.49),
 (7, '2012-03-20 17:03:41', 7, 1, 1, 49.99, 19.49),
 (8, '2012-03-20 23:35:27', 8, 1, 1, 49.99, 19.49),
 (9, '2012-03-21 02:35:01', 9, 1, 1, 49.99, 19.49),
 (10, '2012-03-21 06:45:58', 10, 1, 1, 49.99, 19.49)]

In [10]:
%%sql

DESCRIBE order_items;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
7 rows affected.

[('order_item_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('order_id', 'bigint(20)', 'YES', '', None, ''),
 ('product_id', 'bigint(20)', 'YES', '', None, ''),
 ('is_primary_item', 'bigint(20)', 'YES', '', None, ''),
 ('price_usd', 'double', 'YES', '', None, ''),
 ('cogs_usd', 'double', 'YES', '', None, '')]

In [11]:
%%sql

SELECT * FROM order_item_refunds LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, '2012-04-06 11:32:43', 57, 57, 49.99),
 (2, '2012-04-13 01:09:43', 74, 74, 49.99),
 (3, '2012-04-15 07:03:48', 71, 71, 49.99),
 (4, '2012-04-17 20:00:37', 118, 118, 49.99),
 (5, '2012-04-22 20:53:49', 116, 116, 49.99),
 (6, '2012-05-04 11:59:07', 147, 147, 49.99),
 (7, '2012-05-12 02:41:14', 186, 186, 49.99),
 (8, '2012-05-16 13:06:01', 191, 191, 49.99),
 (9, '2012-05-24 16:00:09', 179, 179, 49.99),
 (10, '2012-05-30 17:20:44', 199, 199, 49.99)]

In [12]:
%%sql
DESCRIBE order_item_refunds;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
5 rows affected.

[('order_item_refund_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('order_item_id', 'bigint(20)', 'YES', '', None, ''),
 ('order_id', 'bigint(20)', 'YES', '', None, ''),
 ('refund_amount_usd', 'double', 'YES', '', None, '')]

In [15]:
%%sql

SELECT * FROM website_pageviews LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, '2012-03-19 08:04:16', 1, '/home'),
 (2, '2012-03-19 08:16:49', 2, '/home'),
 (3, '2012-03-19 08:26:55', 3, '/home'),
 (4, '2012-03-19 08:37:33', 4, '/home'),
 (5, '2012-03-19 09:00:55', 5, '/home'),
 (6, '2012-03-19 09:05:46', 6, '/home'),
 (7, '2012-03-19 09:06:27', 7, '/home'),
 (8, '2012-03-19 09:10:08', 6, '/products'),
 (9, '2012-03-19 09:10:52', 6, '/the-original-mr-fuzzy'),
 (10, '2012-03-19 09:14:02', 6, '/cart')]

In [16]:
%%sql 
DESCRIBE website_pageviews;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[('website_pageview_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('website_session_id', 'bigint(20)', 'YES', '', None, ''),
 ('pageview_url', 'text', 'YES', '', None, '')]

In [17]:
%%sql
SELECT * FROM website_sessions LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, '2012-03-19 08:04:16', 1, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com'),
 (2, '2012-03-19 08:16:49', 2, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'desktop', 'https://www.gsearch.com'),
 (3, '2012-03-19 08:26:55', 3, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'desktop', 'https://www.gsearch.com'),
 (4, '2012-03-19 08:37:33', 4, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'desktop', 'https://www.gsearch.com'),
 (5, '2012-03-19 09:00:55', 5, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com'),
 (6, '2012-03-19 09:05:46', 6, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'desktop', 'https://www.gsearch.com'),
 (7, '2012-03-19 09:06:27', 7, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com'),
 (8, '2012-03-19 09:17:17', 8, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com'),
 (9, '2012-03-19 09:27:56', 9, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com'),
 (10, '2012-03-19 09:35:37', 10, 0, 'gsearch', 'nonbrand', 'g_ad_1', 'mobile', 'https://www.gsearch.com')]

In [18]:
%%sql
DESCRIBE website_sessions;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
9 rows affected.

[('website_session_id', 'bigint(20)', 'YES', '', None, ''),
 ('created_at', 'text', 'YES', '', None, ''),
 ('user_id', 'bigint(20)', 'YES', '', None, ''),
 ('is_repeat_session', 'bigint(20)', 'YES', '', None, ''),
 ('utm_source', 'text', 'YES', '', None, ''),
 ('utm_campaign', 'text', 'YES', '', None, ''),
 ('utm_content', 'text', 'YES', '', None, ''),
 ('device_type', 'text', 'YES', '', None, ''),
 ('http_referer', 'text', 'YES', '', None, '')]

In [25]:
%%sql

CREATE VIEW farm_survey_performance AS
SELECT 
    o.order_id,
    o.created_at AS order_date,
    o.user_id,
    o.items_purchased,
    o.price_usd AS order_price,
    o.cogs_usd AS order_cogs,
    
    oi.order_item_id,
    oi.product_id,
    p.product_name,
    oi.price_usd AS item_price,
    oi.cogs_usd AS item_cogs,
    oi.is_primary_item,
    
    oir.order_item_refund_id,
    oir.refund_amount_usd,
    
    ws.website_session_id,
    ws.created_at AS session_date,
    ws.is_repeat_session,
    ws.utm_source,
    ws.utm_campaign,
    ws.device_type,
    
    wp.website_pageview_id,
    wp.pageview_url,
    wp.created_at AS pageview_date

FROM orders o
LEFT JOIN order_items oi 
    ON o.order_id = oi.order_id
LEFT JOIN order_item_refunds oir 
    ON oi.order_item_id = oir.order_item_id
LEFT JOIN products p 
    ON oi.product_id = p.product_id
LEFT JOIN website_sessions ws 
    ON o.website_session_id = ws.website_session_id
LEFT JOIN website_pageviews wp 
    ON ws.website_session_id = wp.website_session_id;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
0 rows affected.

[]

In [27]:
%%sql

SELECT * FROM farm_survey_performance LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
20 rows affected.

[(1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 30, '/home', '2012-03-19 10:22:58'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 32, '/products', '2012-03-19 10:28:09'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 33, '/the-original-mr-fuzzy', '2012-03-19 10:28:37'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 34, '/cart', '2012-03-19 10:31:29'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 35, '/shipping', '2012-03-19 10:34:43'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 36, '/billing', '2012-03-19 10:36:31'),
 (1, '2012-03-19 10:42:46', 20, 1, 49.99, 19.49, 1, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 20, '2012-03-19 10:22:58', 0, 'gsearch', 'nonbrand', 'desktop', 37, '/thank-you-for-your-order', '2012-03-19 10:42:46'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 178, '/home', '2012-03-19 19:14:04'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 179, '/products', '2012-03-19 19:15:13'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 180, '/the-original-mr-fuzzy', '2012-03-19 19:17:59'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 181, '/cart', '2012-03-19 19:21:31'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 182, '/shipping', '2012-03-19 19:23:19'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 183, '/billing', '2012-03-19 19:23:47'),
 (2, '2012-03-19 19:27:37', 104, 1, 49.99, 19.49, 2, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 104, '2012-03-19 19:14:04', 0, 'gsearch', 'nonbrand', 'desktop', 184, '/thank-you-for-your-order', '2012-03-19 19:27:37'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 254, '/home', '2012-03-20 06:21:56'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 255, '/products', '2012-03-20 06:26:08'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 256, '/the-original-mr-fuzzy', '2012-03-20 06:29:09'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 257, '/cart', '2012-03-20 06:32:22'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 258, '/shipping', '2012-03-20 06:35:05'),
 (3, '2012-03-20 06:44:45', 147, 1, 49.99, 19.49, 3, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, None, None, 147, '2012-03-20 06:21:56', 0, 'gsearch', 'nonbrand', 'desktop', 259, '/billing', '2012-03-20 06:37:30')]

In [28]:
%%sql

CREATE VIEW order_related_view AS
SELECT 
    o.order_id,
    o.created_at AS order_date,
    o.user_id,
    o.items_purchased,
    o.price_usd AS order_price,
    o.cogs_usd AS order_cogs,
    
    oi.order_item_id,
    oi.product_id,
    p.product_name,
    oi.price_usd AS item_price,
    oi.cogs_usd AS item_cogs,
    oi.is_primary_item,
    
    oir.order_item_refund_id,
    oir.refund_amount_usd

FROM orders o
LEFT JOIN order_items oi
    ON o.order_id = oi.order_id
LEFT JOIN order_item_refunds oir
    ON oi.order_item_id = oir.order_item_id
LEFT JOIN products p
    ON oi.product_id = p.product_id;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
0 rows affected.

[]

In [29]:
%%sql 
SELECT * FROM order_related_view LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
20 rows affected.

[(57, '2012-03-31 02:32:43', 1794, 1, 49.99, 19.49, 57, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 1, 49.99),
 (74, '2012-04-03 19:09:43', 2309, 1, 49.99, 19.49, 74, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 2, 49.99),
 (71, '2012-04-03 15:03:48', 2247, 1, 49.99, 19.49, 71, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 3, 49.99),
 (118, '2012-04-15 09:00:37', 4065, 1, 49.99, 19.49, 118, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 4, 49.99),
 (116, '2012-04-13 14:53:49', 3895, 1, 49.99, 19.49, 116, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 5, 49.99),
 (147, '2012-04-23 20:59:07', 4832, 1, 49.99, 19.49, 147, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 6, 49.99),
 (186, '2012-05-09 17:41:14', 6381, 1, 49.99, 19.49, 186, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 7, 49.99),
 (191, '2012-05-11 15:06:01', 5115, 1, 49.99, 19.49, 191, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 8, 49.99),
 (179, '2012-05-09 01:00:09', 6288, 1, 49.99, 19.49, 179, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 9, 49.99),
 (199, '2012-05-15 03:20:44', 6869, 1, 49.99, 19.49, 199, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 10, 49.99),
 (271, '2012-06-01 14:22:14', 8911, 1, 49.99, 19.49, 271, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 11, 49.99),
 (290, '2012-06-06 10:54:47', 9374, 1, 49.99, 19.49, 290, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 12, 49.99),
 (335, '2012-06-15 23:13:12', 10668, 1, 49.99, 19.49, 335, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 13, 49.99),
 (382, '2012-06-25 19:54:22', 11776, 1, 49.99, 19.49, 382, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 14, 49.99),
 (357, '2012-06-20 13:50:01', 11176, 1, 49.99, 19.49, 357, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 15, 49.99),
 (409, '2012-07-02 13:24:53', 12530, 1, 49.99, 19.49, 409, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 16, 49.99),
 (368, '2012-06-22 11:36:44', 11443, 1, 49.99, 19.49, 368, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 17, 49.99),
 (391, '2012-06-27 11:54:28', 11986, 1, 49.99, 19.49, 391, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 18, 49.99),
 (424, '2012-07-05 09:59:09', 12909, 1, 49.99, 19.49, 424, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 19, 49.99),
 (393, '2012-06-27 19:31:05', 12061, 1, 49.99, 19.49, 393, 1, 'The Original Mr. Fuzzy', 49.99, 19.49, 1, 20, 49.99)]

In [36]:
%%sql

SELECT COUNT(DISTINCT user_id) AS unique_count
FROM order_related_view;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(31696,)]

In [37]:
%%sql

CREATE VIEW grouped_data AS
SELECT 
    o.order_id,
    o.user_id,
    o.created_at AS order_date,
    COUNT(DISTINCT oi.order_item_id) AS total_items,
    SUM(oi.price_usd) AS order_revenue,
    SUM(oi.cogs_usd) AS order_cogs,
    SUM(COALESCE(r.refund_amount_usd, 0)) AS total_refunds,
    SUM(oi.price_usd) - SUM(oi.cogs_usd) AS gross_profit,
    SUM(oi.price_usd) - SUM(oi.cogs_usd) - SUM(COALESCE(r.refund_amount_usd, 0)) AS net_profit,
    
    ws.website_session_id,
    ws.is_repeat_session,
    ws.utm_source,
    ws.utm_campaign,
    ws.device_type,
    COUNT(DISTINCT wp.website_pageview_id) AS pages_viewed

FROM orders o
LEFT JOIN order_items oi 
    ON o.order_id = oi.order_id
LEFT JOIN order_item_refunds r 
    ON oi.order_item_id = r.order_item_id
LEFT JOIN website_sessions ws 
    ON o.website_session_id = ws.website_session_id
LEFT JOIN website_pageviews wp 
    ON ws.website_session_id = wp.website_session_id

GROUP BY 
    o.order_id, 
    o.user_id, 
    o.created_at, 
    ws.website_session_id,
    ws.is_repeat_session,
    ws.utm_source,
    ws.utm_campaign,
    ws.device_type
ORDER BY o.created_at DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
0 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM grouped_data LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db

### 1. Orders and Order Items Analysis

#### Revenue and Profitability
- Total revenue = SUM(price_usd) from orders or order_items.
- Cost of Goods Sold (COGS) = SUM(cogs_usd).
- Gross profit = Revenue  COGS.
- Profit margin per product or order.

In [3]:
%%sql

SELECT 
    SUM(oi.price_usd) AS total_revenue,
    SUM(oi.cogs_usd) AS total_cogs,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / (SUM(oi.price_usd)) AS profit_margin
FROM 
    order_items oi;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(1938509.7499996577, 722370.249999704, 1216139.499999954, 0.6273579485479341)]

In [32]:
%%sql
-- PROFITABILITY PER ORDER

WITH top_orders_cte AS (
SELECT 
    o.order_id,
    SUM(oi.price_usd) AS order_revenue,
    SUM(oi.cogs_usd) AS order_cogs,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS order_gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / (SUM(oi.price_usd)) AS order_profit_margin
FROM orders o
JOIN order_items oi
    ON o.order_id = oi.order_id  
GROUP BY o.order_id
ORDER BY o.order_id
)

SELECT * FROM top_orders_cte LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (2, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (3, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (4, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (5, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (6, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (7, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (8, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (9, 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (10, 49.99, 19.49, 30.500000000000004, 0.6101220244048811)]

In [33]:
%%sql
-- PROFITABILITY PER DAY

WITH revenue_trend_cte AS (
    SELECT 
        DATE(o.created_at) AS order_date,
        DATE_FORMAT(o.created_at, '%Y-%m') AS order_month,
        DATE_FORMAT(o.created_at, '%Y') AS order_year,
        SUM(oi.price_usd) AS revenue,
        SUM(oi.cogs_usd) AS cogs,
        SUM(oi.price_usd) - SUM(oi.cogs_usd) AS gross_profit,
        (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / SUM(oi.price_usd) AS profit_margin
    FROM orders o
    JOIN order_items oi
        ON o.order_id = oi.order_id
    GROUP BY DATE(o.created_at)
)

SELECT *
FROM revenue_trend_cte
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(datetime.date(2012, 3, 19), '2012-03', '2012', 99.98, 38.98, 61.00000000000001, 0.6101220244048811),
 (datetime.date(2012, 3, 20), '2012-03', '2012', 299.94, 116.93999999999998, 183.0, 0.610122024404881),
 (datetime.date(2012, 3, 21), '2012-03', '2012', 449.91, 175.41, 274.5, 0.610122024404881),
 (datetime.date(2012, 3, 22), '2012-03', '2012', 199.96, 77.96, 122.00000000000001, 0.6101220244048811),
 (datetime.date(2012, 3, 23), '2012-03', '2012', 149.97, 58.47, 91.5, 0.610122024404881),
 (datetime.date(2012, 3, 24), '2012-03', '2012', 49.99, 19.49, 30.500000000000004, 0.6101220244048811),
 (datetime.date(2012, 3, 25), '2012-03', '2012', 199.96, 77.96, 122.00000000000001, 0.6101220244048811),
 (datetime.date(2012, 3, 26), '2012-03', '2012', 449.91, 175.41, 274.5, 0.610122024404881),
 (datetime.date(2012, 3, 27), '2012-03', '2012', 99.98, 38.98, 61.00000000000001, 0.6101220244048811),
 (datetime.date(2012, 3, 28), '2012-03', '2012', 249.95000000000002, 97.44999999999999, 152.50000000000003, 0.6101220244048811)]

#### a. Order per day

In [67]:
%%sql

SELECT 
    DATE_FORMAT(o.created_at, '%Y-%m-%d') AS order_day,
    COUNT(order_id) AS order_counts
FROM orders o
GROUP BY DATE_FORMAT(o.created_at, '%Y-%m-%d')
ORDER BY order_counts DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[('2014-11-28', 417),
 ('2014-12-01', 339),
 ('2013-11-29', 218),
 ('2013-12-02', 160),
 ('2012-11-23', 149),
 ('2015-02-10', 119),
 ('2015-02-11', 119),
 ('2015-02-12', 117),
 ('2012-11-26', 108),
 ('2014-12-24', 105)]

#### b. Order per Month

In [69]:
%%sql
-- Monthly Seasonality

SELECT 
    DATE_FORMAT(o.created_at, '%Y-%m') AS order_month,
    COUNT(order_id) AS order_counts
FROM orders o
GROUP BY DATE_FORMAT(o.created_at, '%Y-%m')
ORDER BY order_month DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
37 rows affected.

[('2015-03', 1254),
 ('2015-02', 2068),
 ('2015-01', 2098),
 ('2014-12', 2314),
 ('2014-11', 1985),
 ('2014-10', 1609),
 ('2014-09', 1424),
 ('2014-08', 1325),
 ('2014-07', 1286),
 ('2014-06', 1239),
 ('2014-05', 1368),
 ('2014-04', 1241),
 ('2014-03', 1066),
 ('2014-02', 1021),
 ('2014-01', 982),
 ('2013-12', 1047),
 ('2013-11', 861),
 ('2013-10', 708),
 ('2013-09', 629),
 ('2013-08', 608),
 ('2013-07', 604),
 ('2013-06', 593),
 ('2013-05', 571),
 ('2013-04', 553),
 ('2013-03', 385),
 ('2013-02', 498),
 ('2013-01', 390),
 ('2012-12', 506),
 ('2012-11', 618),
 ('2012-10', 371),
 ('2012-09', 287),
 ('2012-08', 228),
 ('2012-07', 169),
 ('2012-06', 140),
 ('2012-05', 108),
 ('2012-04', 99),
 ('2012-03', 60)]

#### c. Order per Year

In [63]:
%%sql

SELECT 
    DATE_FORMAT(o.created_at, '%Y') AS order_year,
    COUNT(order_id) AS order_counts
FROM orders o
GROUP BY DATE_FORMAT(o.created_at, '%Y')
ORDER BY order_counts DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[('2014', 16860), ('2013', 7447), ('2015', 5420), ('2012', 2586)]

#### d. Revenue per Day

In [71]:
%%sql

SELECT 
    DATE_FORMAT(o.created_at, '%Y-%m-%d') AS order_day,
    SUM(oi.price_usd) AS total_revenue
FROM orders o
JOIN order_items oi 
        ON oi.order_id = o.order_id
GROUP BY DATE_FORMAT(o.created_at, '%Y-%m-%d')
ORDER BY total_revenue DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[('2014-11-28', 27404.23000000031),
 ('2014-12-01', 22323.310000000132),
 ('2013-11-29', 11707.73999999996),
 ('2013-12-02', 8538.349999999973),
 ('2015-02-10', 7562.509999999977),
 ('2015-02-12', 7468.489999999977),
 ('2012-11-23', 7448.509999999977),
 ('2015-02-11', 7430.509999999977),
 ('2015-03-09', 6698.569999999979),
 ('2014-12-19', 6568.579999999979)]

#### e. Revenue per Month

In [72]:
%%sql

SELECT 
    DATE_FORMAT(o.created_at, '%Y-%m') AS order_month,
    SUM(oi.price_usd) AS total_revenue
FROM orders o
JOIN order_items oi 
        ON oi.order_id = o.order_id
GROUP BY DATE_FORMAT(o.created_at, '%Y-%m')
ORDER BY total_revenue DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[('2014-12', 144823.0200000037),
 ('2015-01', 132211.5400000062),
 ('2015-02', 129212.94000000629),
 ('2014-11', 128162.98000000598),
 ('2014-10', 103905.9800000034),
 ('2014-09', 92232.49000000206),
 ('2014-05', 88935.27000000165),
 ('2014-08', 84716.08000000122),
 ('2014-07', 83288.55000000108),
 ('2014-06', 80051.25000000071)]

#### f. Revenue per Year

In [73]:
%%sql

SELECT 
    DATE_FORMAT(o.created_at, '%Y') AS order_year,
    SUM(oi.price_usd) AS total_revenue
FROM orders o
JOIN order_items oi 
        ON oi.order_id = o.order_id
GROUP BY DATE_FORMAT(o.created_at, '%Y')
ORDER BY total_revenue DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[('2014', 1075612.1899998204),
 ('2013', 393247.8699999585),
 ('2015', 340375.54999996524),
 ('2012', 129274.1400000058)]

### 2. Top Products
- Aggregate items_purchased and price_usd by primary_product_id or product_id.
- Identify best-selling products or most profitable items.

In [14]:
%%sql
-- PROFITABILITY PER PRODUCT

WITH top_products_cte AS (
    SELECT 
        p.product_id,
        p.product_name,
        SUM(oi.price_usd) AS product_revenue,
        SUM(oi.cogs_usd) AS product_cogs,
        (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS product_gross_profit,
        (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / (SUM(oi.price_usd)) AS product_profit_margin
    FROM products p
    JOIN order_items oi
        ON p.product_id = oi.product_id
    GROUP BY product_id
)

SELECT * FROM top_products_cte ORDER BY product_revenue DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 1211057.7399998049, 472164.73999985243, 738892.9999999525, 0.61012202440494),
 (2, 'The Forever Love Bear', 347702.0399999714, 130352.04000001316, 217349.99999995824, 0.6251041840306031),
 (3, 'The Birthday Sugar Panda', 229260.14999998664, 72232.64999999941, 157027.49999998722, 0.6849315068492993),
 (4, 'The Hudson River Mini bear', 150489.82000000397, 47620.81999999924, 102869.00000000471, 0.6835611870623675)]

#### Best selling product by quantity sold

In [27]:
%%sql

SELECT
    oi.product_id,
    p.product_name,
    COUNT(oi.order_item_id) AS units_sold
FROM order_items oi
JOIN products p ON p.product_id = oi.product_id
GROUP BY oi.product_id, p.product_name
ORDER BY units_sold DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 24226),
 (2, 'The Forever Love Bear', 5796),
 (4, 'The Hudson River Mini bear', 5018),
 (3, 'The Birthday Sugar Panda', 4985)]

#### Top products by Revenue

In [28]:
%%sql

SELECT
    oi.product_id,
    p.product_name,
    SUM(oi.price_usd) AS total_revenue
FROM order_items oi
JOIN products p ON p.product_id = oi.product_id
GROUP BY oi.product_id, p.product_name
ORDER BY total_revenue DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 1211057.7399998049),
 (2, 'The Forever Love Bear', 347702.0399999714),
 (3, 'The Birthday Sugar Panda', 229260.14999998664),
 (4, 'The Hudson River Mini bear', 150489.82000000397)]

#### Top products by Profit

In [80]:
%%sql
-- Product Revenue and Profits

SELECT 
    p.product_id,
    p.product_name,
    SUM(oi.price_usd) AS revenue,
    SUM(oi.cogs_usd) AS cogs,
    SUM(oi.price_usd) - SUM(oi.cogs_usd) AS gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / SUM(oi.price_usd) AS profit_margin
FROM products p
JOIN order_items oi
    ON p.product_id = oi.product_id
GROUP BY p.product_id, p.product_name
ORDER BY gross_profit DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 1211057.7399998049, 472164.73999985243, 738892.9999999525, 0.61012202440494),
 (2, 'The Forever Love Bear', 347702.0399999714, 130352.04000001316, 217349.99999995824, 0.6251041840306031),
 (3, 'The Birthday Sugar Panda', 229260.14999998664, 72232.64999999941, 157027.49999998722, 0.6849315068492993),
 (4, 'The Hudson River Mini bear', 150489.82000000397, 47620.81999999924, 102869.00000000471, 0.6835611870623675)]

#### Refunds per product

In [81]:
%%sql

SELECT
    p.product_id,
    p.product_name,
    SUM(COALESCE(r.refund_amount_usd, 0)) AS total_refunds
FROM products p
LEFT JOIN order_items oi 
    ON p.product_id = oi.product_id
LEFT JOIN order_item_refunds r 
    ON oi.order_item_id = r.order_item_id
GROUP BY p.product_id, p.product_name
ORDER BY total_refunds DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 61837.62999999928),
 (3, 'The Birthday Sugar Panda', 13842.989999999945),
 (2, 'The Forever Love Bear', 7738.70999999998),
 (4, 'The Hudson River Mini bear', 1919.3600000000004)]

#### Product Returns/Refund Rate

- Refund rate = refunds  revenue
    - (High refund rate = risk; product may have quality issues or expectation mismatch)

- This ranks products from highest refund rate (worst performing) to lowest refund rate.

In [82]:
%%sql

SELECT
    p.product_id,
    p.product_name,
    SUM(oi.price_usd) AS revenue,
    SUM(COALESCE(r.refund_amount_usd, 0)) AS refunds,
    (SUM(COALESCE(r.refund_amount_usd, 0)) / SUM(oi.price_usd)) AS refund_rate
FROM products p
JOIN order_items oi 
    ON p.product_id = oi.product_id
LEFT JOIN order_item_refunds r 
    ON oi.order_item_id = r.order_item_id
GROUP BY p.product_id, p.product_name
HAVING revenue > 0
ORDER BY refund_rate DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(3, 'The Birthday Sugar Panda', 229260.14999998664, 13842.989999999945, 0.06038114343029415),
 (1, 'The Original Mr. Fuzzy', 1211057.7399998049, 61837.62999999928, 0.05106084372162903),
 (2, 'The Forever Love Bear', 347702.0399999714, 7738.70999999998, 0.02225672877846968),
 (4, 'The Hudson River Mini bear', 150489.82000000397, 1919.3600000000004, 0.012754085292945062)]

#### Full Product Performance Dashboard Query

In [77]:
%%sql

SELECT
    p.product_id,
    p.product_name,

    -- Popularity
    COUNT(oi.order_item_id) AS units_sold,

    -- Revenue & Profit
    SUM(oi.price_usd) AS total_revenue,
    SUM(oi.cogs_usd) AS total_cogs,
    SUM(oi.price_usd) - SUM(oi.cogs_usd) AS gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) / SUM(oi.price_usd) AS profit_margin,

    -- Refunds
    SUM(COALESCE(r.refund_amount_usd, 0)) AS total_refunds,
    SUM(COALESCE(r.refund_amount_usd, 0)) / SUM(oi.price_usd) AS refund_rate
FROM products p
LEFT JOIN order_items oi
    ON p.product_id = oi.product_id
LEFT JOIN order_item_refunds r
    ON oi.order_item_id = r.order_item_id
GROUP BY p.product_id, p.product_name
ORDER BY units_sold DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(1, 'The Original Mr. Fuzzy', 24226, 1211057.7399998049, 472164.73999985243, 738892.9999999525, 0.61012202440494, 61837.62999999928, 0.05106084372162903),
 (2, 'The Forever Love Bear', 5796, 347702.0399999714, 130352.04000001316, 217349.99999995824, 0.6251041840306031, 7738.70999999998, 0.02225672877846968),
 (4, 'The Hudson River Mini bear', 5018, 150489.82000000397, 47620.81999999924, 102869.00000000471, 0.6835611870623675, 1919.3600000000004, 0.012754085292945062),
 (3, 'The Birthday Sugar Panda', 4985, 229260.14999998664, 72232.64999999941, 157027.49999998722, 0.6849315068492993, 13842.989999999945, 0.06038114343029415)]

### 3. Refund Analysis

In [31]:
%%sql

WITH daily_profitability_cte AS (
    SELECT
        DATE(o.created_at) AS order_date,
        SUM(oi.price_usd) AS revenue,
        SUM(oi.cogs_usd) AS cogs,
        (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS gross_profit,
        COALESCE(SUM(r.refund_amount_usd), 0) AS refunds,
        -- Net Profit = Revenue - COGS - Refunds
        (SUM(oi.price_usd) - SUM(oi.cogs_usd) - COALESCE(SUM(r.refund_amount_usd), 0)) AS net_profit,
        -- Profit Margin = Net Profit / Revenue
        ROUND(
            (SUM(oi.price_usd) - SUM(oi.cogs_usd) - COALESCE(SUM(r.refund_amount_usd), 0))
            / NULLIF(SUM(oi.price_usd), 0),
            4
        ) AS net_profit_margin,
        -- Refund Rate = refunds / revenue
        ROUND(
            COALESCE(SUM(r.refund_amount_usd), 0) / NULLIF(SUM(oi.price_usd), 0),
            4
        ) AS refund_rate

    FROM orders o
    JOIN order_items oi 
        ON o.order_id = oi.order_id
    LEFT JOIN order_item_refunds r 
        ON oi.order_item_id = r.order_item_id

    GROUP BY DATE(o.created_at)
)

SELECT *
FROM daily_profitability_cte
ORDER BY order_date
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(datetime.date(2012, 3, 19), 99.98, 38.98, 61.00000000000001, 0.0, 61.00000000000001, 0.6101, 0.0),
 (datetime.date(2012, 3, 20), 299.94, 116.93999999999998, 183.0, 0.0, 183.0, 0.6101, 0.0),
 (datetime.date(2012, 3, 21), 449.91, 175.41, 274.5, 0.0, 274.5, 0.6101, 0.0),
 (datetime.date(2012, 3, 22), 199.96, 77.96, 122.00000000000001, 0.0, 122.00000000000001, 0.6101, 0.0),
 (datetime.date(2012, 3, 23), 149.97, 58.47, 91.5, 0.0, 91.5, 0.6101, 0.0),
 (datetime.date(2012, 3, 24), 49.99, 19.49, 30.500000000000004, 0.0, 30.500000000000004, 0.6101, 0.0),
 (datetime.date(2012, 3, 25), 199.96, 77.96, 122.00000000000001, 0.0, 122.00000000000001, 0.6101, 0.0),
 (datetime.date(2012, 3, 26), 449.91, 175.41, 274.5, 0.0, 274.5, 0.6101, 0.0),
 (datetime.date(2012, 3, 27), 99.98, 38.98, 61.00000000000001, 0.0, 61.00000000000001, 0.6101, 0.0),
 (datetime.date(2012, 3, 28), 249.95000000000002, 97.44999999999999, 152.50000000000003, 0.0, 152.50000000000003, 0.6101, 0.0)]

#### a. Total Refunds

In [34]:
%%sql

SELECT
    SUM(refund_amount_usd) AS total_refunds
FROM order_item_refunds;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(85338.69000000124,)]

#### b. Refund rate (refunds  revenue)

In [36]:
%%sql

SELECT
    SUM(oir.refund_amount_usd) / SUM(oi.price_usd) AS refund_rate
FROM order_item_refunds oir
JOIN order_items oi
    ON oir.order_item_id = oi.order_item_id;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(1.0,)]

In [37]:
%%sql

SELECT
    SUM(r.refund_amount_usd) / SUM(oi.price_usd) AS refund_rate
FROM order_item_refunds r
CROSS JOIN order_items oi;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(1.0179167362017951,)]

#### c. Products with highest refund rate

- This identifies products with potential quality issues

In [43]:
%%sql

SELECT 
    oi.product_id,
    p.product_name,
    SUM(oi.price_usd) AS revenue,
    SUM(COALESCE(oir.refund_amount_usd, 0)) AS refunds,
    SUM(COALESCE(oir.refund_amount_usd, 0)) / SUM(oi.price_usd) AS refund_rate
FROM order_items oi
LEFT JOIN order_item_refunds oir
    ON oi.order_item_id = oir.order_item_id
JOIN products p
    ON oi.product_id = p.product_id
GROUP BY oi.product_id, p.product_name
HAVING revenue > 0
ORDER BY refund_rate DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
4 rows affected.

[(3, 'The Birthday Sugar Panda', 229260.14999998664, 13842.989999999945, 0.06038114343029415),
 (1, 'The Original Mr. Fuzzy', 1211057.7399998049, 61837.62999999928, 0.05106084372162903),
 (2, 'The Forever Love Bear', 347702.0399999714, 7738.70999999998, 0.02225672877846968),
 (4, 'The Hudson River Mini bear', 150489.82000000397, 1919.3600000000004, 0.012754085292945062)]

### 3. Customer Behavior

- Orders per user = COUNT(order_id) grouped by user_id.
- Average order value (AOV) = price_usd  items_purchased.
- Repeat vs new buyers if user_id is linked to repeat sessions.

#### a. Orders per User

In [47]:
%%sql

SELECT 
    user_id,
    COUNT(order_id) AS orders_count
FROM orders
GROUP BY user_id
ORDER BY orders_count DESC LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(157480, 3),
 (318660, 3),
 (336150, 3),
 (142410, 3),
 (341972, 3),
 (371472, 3),
 (275098, 3),
 (276897, 3),
 (344087, 3),
 (107850, 3)]

#### b. Average Order Value (AOV)

In [48]:
%%sql

SELECT 
    AVG(price_usd) AS average_order_value
FROM orders;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(59.99163649304174,)]

In [50]:
%%sql

SELECT 
    user_id,
    AVG(price_usd) AS average_order_value
FROM orders
GROUP BY user_id LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(13, 49.99),
 (20, 49.99),
 (59, 49.99),
 (104, 49.99),
 (147, 49.99),
 (160, 49.99),
 (167, 49.99),
 (177, 49.99),
 (210, 49.99),
 (232, 49.99)]

#### c. Repeat vs new buyers

- Using website sessions

In [ ]:
%%sql

SELECT
    ws.is_repeat_session,
    COUNT(DISTINCT o.order_id) AS orders_count
FROM orders o
JOIN website_sessions ws 
    ON ws.website_session_id = o.website_session_id
GROUP BY ws.is_repeat_session 
LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db

In [83]:
%%sql

CREATE OR REPLACE VIEW order_analytics_view AS
SELECT
    /* -------------------- ORDER-LEVEL ----------------------- */
    o.order_id,
    o.created_at AS order_created_at,
    o.user_id AS user_id,
    o.website_session_id,
    o.primary_product_id,
    
    -- Order totals
    SUM(oi.price_usd) AS order_revenue,
    SUM(oi.cogs_usd) AS order_cogs,
    COALESCE(SUM(oif.refund_amount_usd), 0) AS order_refunds,
    
    -- Profits
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS order_gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd) - COALESCE(SUM(oif.refund_amount_usd), 0)) AS order_net_profit,

    /* -------------------- PRODUCT-LEVEL ----------------------- */
    oi.product_id,
    p.product_name,
    SUM(oi.price_usd) AS product_revenue,
    SUM(oi.cogs_usd) AS product_cogs,
    COALESCE(SUM(oif.refund_amount_usd), 0) AS product_refunds,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd)) AS product_gross_profit,
    (SUM(oi.price_usd) - SUM(oi.cogs_usd) - COALESCE(SUM(oif.refund_amount_usd), 0)) AS product_net_profit,

    /* -------------------- USER-LEVEL ----------------------- */
    u.total_user_orders,
    u.total_user_revenue,
    u.first_order_date,
    u.last_order_date,

    /* -------------------- SESSION-LEVEL -------------------- */
    ws.is_repeat_session,
    ws.utm_source,
    ws.utm_campaign,
    ws.utm_content,
    ws.device_type,
    ws.http_referer,
    wps.pageviews_count AS session_pageviews

FROM orders o
JOIN order_items oi 
    ON o.order_id = oi.order_id
LEFT JOIN order_item_refunds oif
    ON oi.order_item_id = oif.order_item_id
JOIN products p
    ON oi.product_id = p.product_id
LEFT JOIN website_sessions ws
    ON o.website_session_id = ws.website_session_id

/* -------------------- USER METRICS SUBQUERY -------------------- */
LEFT JOIN (
    SELECT
        o2.user_id,
        COUNT(DISTINCT o2.order_id) AS total_user_orders,
        SUM(oi2.price_usd) AS total_user_revenue,
        MIN(o2.created_at) AS first_order_date,
        MAX(o2.created_at) AS last_order_date
    FROM orders o2
    JOIN order_items oi2 ON o2.order_id = oi2.order_id
    GROUP BY o2.user_id
) u ON o.user_id = u.user_id

/* -------------------- SESSION PAGEVIEW COUNTS -------------------- */
LEFT JOIN (
    SELECT 
        website_session_id,
        COUNT(*) AS pageviews_count
    FROM website_pageviews
    GROUP BY website_session_id
) wps
ON o.website_session_id = wps.website_session_id

GROUP BY 
    o.order_id,
    oi.product_id;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
0 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM order_analytics_view;

### 4. Session Analysis

#### a. Count of sessions per user

In [92]:
%%sql

SELECT 
    user_id,
    COUNT(website_session_id) AS website_session_counts
FROM website_sessions
GROUP BY user_id 
ORDER BY website_session_counts DESC
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
10 rows affected.

[(1015, 4),
 (196, 4),
 (1207, 4),
 (514, 4),
 (180, 4),
 (1097, 4),
 (885, 4),
 (769, 4),
 (713, 4),
 (436, 4)]

#### b. Repeat sessions vs new sessions
- 0 = first-time session
- 1 = repeat session

In [93]:
%%sql

SELECT
    is_repeat_session,
    COUNT(*) AS sessions_count
FROM website_sessions
GROUP BY is_repeat_session;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
2 rows affected.

[(0, 394318), (1, 78553)]

#### c. Campaign source vs Conversion rate

In [ ]:
%%sql

SELECT
    ws.utm_source,
    ws.utm_campaign,
    COUNT(DISTINCT ws.website_session_id) AS total_sessions,
    COUNT(DISTINCT o.order_id) AS total_orders,
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) AS conversion_rate
FROM website_sessions ws
LEFT JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY ws.utm_source, ws.utm_campaign

### 5. Page Views Behavior

#### a. Most visited Pages

In [101]:
%%sql

SELECT
    pageview_url,
    COUNT(*) AS views
FROM website_pageviews
GROUP BY pageview_url
ORDER BY views DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
16 rows affected.

[('/products', 261231),
 ('/the-original-mr-fuzzy', 162525),
 ('/home', 137576),
 ('/lander-2', 131170),
 ('/cart', 94953),
 ('/lander-3', 79000),
 ('/lander-5', 68166),
 ('/shipping', 64484),
 ('/billing-2', 48441),
 ('/lander-1', 47574),
 ('/thank-you-for-your-order', 32313),
 ('/the-forever-love-bear', 26033),
 ('/the-birthday-sugar-panda', 19046),
 ('/lander-4', 9385),
 ('/billing', 3617),
 ('/the-hudson-river-mini-bear', 2610)]

#### b. Average Number of pages per session

In [102]:
%%sql

SELECT
    AVG(pageviews_per_session) AS avg_pages_per_session
FROM (
    SELECT
        website_session_id,
        COUNT(*) AS pageviews_per_session
    FROM website_pageviews
    GROUP BY website_session_id
) AS session_pages;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db
1 rows affected.

[(Decimal('2.5126'),)]

#### c. Funnel analysis (pages users see before buying)

In [ ]:
%%sql

SELECT
    wp.pageview_url,
    COUNT(*) AS views_before_purchase
FROM website_pageviews wp
JOIN orders o
    ON wp.website_session_id = o.website_session_id
GROUP BY wp.pageview_url
ORDER BY views_before_purchase DESC;

 * mysql+pymysql://root:***@localhost:3306/toy_store_db

### 6. Campaign Performance

#### a. Conversion Rate per utm_source, utm_campaign, utm_content

In [ ]:
%%sql

SELECT
    ws.utm_source,
    ws.utm_campaign,
    ws.utm_content,
    COUNT(DISTINCT ws.website_session_id) AS total_sessions,
    COUNT(DISTINCT o.order_id) AS total_orders,
    ROUND(
        COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id), 
        4
    ) AS conversion_rate
FROM website_sessions ws
LEFT JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY
    ws.utm_source,
    ws.utm_campaign,
    ws.utm_content
ORDER BY conversion_rate DESC;

#### b. Revenue Generated per Campaign

In [ ]:
%%sql

SELECT
    ws.utm_source,
    ws.utm_campaign,
    ws.utm_content,
    SUM(o.price_usd) AS total_revenue,
    COUNT(DISTINCT o.order_id) AS orders_count
FROM website_sessions ws
JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY 
    ws.utm_source, 
    ws.utm_campaign, 
    ws.utm_content
ORDER BY total_revenue DESC;

### 7. Referral Effectiveness

#### Revenue & Conversion by http_referer

In [ ]:
%%sql

SELECT
    ws.http_referer,
    COUNT(DISTINCT ws.website_session_id) AS total_sessions,
    COUNT(DISTINCT o.order_id) AS total_orders,
    ROUND(
        COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id),
        4
    ) AS conversion_rate,
    SUM(o.price_usd) AS total_revenue
FROM website_sessions ws
LEFT JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY ws.http_referer
ORDER BY conversion_rate DESC;

### 8. Device and Traffic

#### a. Conversion Rate by device type

In [ ]:
%%sql

SELECT
    ws.device_type,
    COUNT(DISTINCT ws.website_session_id) AS total_sessions,COUNT(DISTINCT o.order_id) AS total_orders,
    ROUND(
        COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id),
        4
    ) AS conversion_rate
FROM website_sessions ws
LEFT JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY ws.device_type
ORDER BY conversion_rate DESC;

#### b. Revenue by device type

In [ ]:
%%sql

SELECT
    ws.device_type,
    SUM(o.price_usd) AS total_revenue,
    COUNT(DISTINCT o.order_id) AS total_orders
FROM website_sessions ws
JOIN orders o
    ON ws.website_session_id = o.website_session_id
GROUP BY ws.device_type
ORDER BY total_revenue DESC;